/******************************************************************
 *	FIFOバッファの扱い.
 ******************************************************************
 *	
 */
#include "fifo.h"

/******************************************************************
 *	FIFO から cnt バイトを取り出す.
 ******************************************************************
 */
int FIFO_getdata(RS_FIFO *f,unsigned char *buf,int cnt)
{
	int n = f->getptr;					// FIFOの取り出しポインタ.
	int i;
	for(i=0;i<cnt;i++) {
		if( n == f->putptr ) break;		// FIFOのトップに追いついた.
		buf[i] = f->buf[n];				// 受信文字をコピーする.
		n++;
		if(	n >= RXBUF_SIZE) {			// 巡回バッファ処理.
			n = 0;
		}
	}
	f->getptr = n;
	return i;
}
/******************************************************************
 *	FIFO に文字を書き込む.
 ******************************************************************
 */
int	FIFO_putch(RS_FIFO *f,int c)
{
	int n = f->putptr;					// FIFOの書き込みポインタ.
	f->buf[n] = c;
	n++;
	if(	n >= RXBUF_SIZE) {
		n = 0;
	}

	// FIFO取り出しポインタに追いついたら、エラー.
	if(n == f->getptr) {
		return (-1);				// Buffer Full!.
	}


	f->putptr = n;
	return 0;				// OK.
}
/******************************************************************
 *	
 ******************************************************************
 */
